Gilevich/Diploma_IMU/C_Code/Inclinometer_MEMS/Inclinometer_MEMS.ioc
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.condition=
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.instance=USART3
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.ip=UART|USART|LPUART
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.mode=Asynchronous
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.name=BSP USART
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.9.1.03.BSP.solution=USART3
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.condition=
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.instance=PB7
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.ip=GPIO
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.mode=Output
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.name=BSP LED
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.9.1.04.BSP.solution=PB7
STMicroelectronics.X-CUBE-MEMS1.9.1.0_SwParameter=BoardOoPartJjAccGyrJjLSM6DSOX\:I2C;SensorsJjSTM32IiMotionDIIiLibraryJjCore\:true;BoardOoSupportJjCustomJjMOTIONIiSENSOR\:true;MEMS1IiApplicationsCcDeviceJjApplication\:CUSTOMIiDynamicInclinometer;
TIM3.IPParameters=Prescaler,Period
TIM3.Period=10000-1
TIM3.Prescaler=216-1
USART3.BaudRate=921600
USART3.DMADisableonRxErrorParam=ADVFEATURE_DMA_ENABLEONRXERROR
USART3.IPParameters=VirtualMode-Asynchronous,WordLength,BaudRate,OverSampling,OverrunDisableParam,DMADisableonRxErrorParam
USART3.OverSampling=UART_OVERSAMPLING_16
USART3.OverrunDisableParam=ADVFEATURE_OVERRUN_ENABLE
USART3.VirtualMode-Asynchronous=VM_ASYNC
USART3.WordLength=WORDLENGTH_8B
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.3.1_9.1.0.Mode=BoardOoPartJjAccGyr
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.3.1_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.3.1_9.1.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_9.1.0_9.1.0.Mode=BoardOoSupportJjCustom
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_9.1.0_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_9.1.0_9.1.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjMEMS1IiApplications_9.1.0_9.1.0.Mode=DeviceJjMEMS1IiApplications
VP_STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjMEMS1IiApplications_9.1.0_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjMEMS1IiApplications_9.1.0_9.1.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_9.1.0.Mode=SensorsJjSTM32IiMotionDIIiLibrary
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_9.1.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
board=custom
isbadioc=false
